ext_alsav/Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УстановкаЦенНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУстановокЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЦенаИзмененаВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ext_alsav/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/Enums/СтатусыУстановокЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыУстановокЦенНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Documents/ПриобретениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриобретениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьТоварноТранспортнаяНакладнаяЕГАИС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТТНВходящаяЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Заказ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОбъектРасчетов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ext_alsav/Documents/УстановкаЦенНоменклатуры/Ext/ManagerModule.bsl
&НаСервере
Функция РасчетатьЗакупочныеЦены(вхДатаСреза = неопределено)ЭКСПОРТ
	
	УстановитьПривилегированныйРежим(Истина);
	
	датаСреза = ?(вхДатаСреза = неопределено, ТекущаяДата(), вхДатаСреза);
	датаСреза = КонецДня(датаСреза);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Постулпения.Номенклатура КАК Номенклатура,
	               |	Постулпения.Характеристика КАК Характеристика,
	               |	МАКСИМУМ(Постулпения.Цена) КАК Цена
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг.Товары КАК Постулпения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МАКСИМУМ(Постулпения.Ссылка.Дата) КАК ДатаПоступления,
	               |			Постулпения.Номенклатура КАК Номенклатура,
	               |			Постулпения.Характеристика КАК Характеристика
	               |		ИЗ
	               |			Документ.ПриобретениеТоваровУслуг.Товары КАК Постулпения
	               |		ГДЕ
	               |			Постулпения.Ссылка.Проведен
	               |			И Постулпения.Ссылка.Организация <> &алсав
	               |			И Постулпения.Цена > 0
	               |			И Постулпения.Ссылка.Дата <= &датаСреза
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Постулпения.Номенклатура,
	               |			Постулпения.Характеристика) КАК Срез
	               |		ПО (Срез.ДатаПоступления = Постулпения.Ссылка.Дата)
	               |			И (Срез.Номенклатура = Постулпения.Номенклатура)
	               |			И (Срез.Характеристика = Постулпения.Характеристика)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&датаСреза, ВидЦены = &ВидЦены) КАК Цены
	               |		ПО (Цены.Номенклатура = Постулпения.Номенклатура)
	               |			И (Цены.Характеристика = Постулпения.Характеристика)
	               |ГДЕ
	               |	Постулпения.Ссылка.Проведен
	               |	И Постулпения.Цена > 0
	               |	И Постулпения.Ссылка.Организация <> &алсав
	               |	И Постулпения.Ссылка.Дата <= &датаСреза
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Постулпения.Номенклатура,
	               |	Постулпения.Характеристика
	               |
	               |ИМЕЮЩИЕ
	               |	МАКСИМУМ(Постулпения.Цена) <> МАКСИМУМ(ЕСТЬNULL(Цены.Цена, 0))";
	
	
	
	видЦеныМатериалы = Справочники.ВидыЦен.НайтиПоНаименованию("Материалы цена");
	алсав = Справочники.Организации.НайтиПоНаименованию("ООО ""АЛСАВ""");
	
	Запрос.УстановитьПараметр("ВидЦены",видЦеныМатериалы);
	Запрос.УстановитьПараметр("алсав",алсав);
	Запрос.УстановитьПараметр("датаСреза",датаСреза);
	
	//// Есть ли новые
	рез = Запрос.Выполнить();	
	Если рез.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	сДок = Получить_УстановкаЦенНоменклатуры(датаСреза);
	оДок = сДок.ПолучитьОбъект();
	Если оДок.Проведен Тогда
		оДок.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	рез = Запрос.Выполнить().Выбрать();
	
	оДок = сДок.ПолучитьОбъект();
	Если оДок.ВидыЦен.Найти(видЦеныМатериалы) = неопределено Тогда
		нСтр = оДок.ВидыЦен.Добавить();
		нСтр.ВидЦены = видЦеныМатериалы;
	КонецЕсли;
	оДок.Товары.Очистить();
	Пока Рез.Следующий() Цикл
		нСтр = оДок.Товары.Добавить();
		нСтр.ВидЦены = видЦеныМатериалы;
		ЗаполнитьЗначенияСвойств(нСтр,Рез);
		нСтр.ЦенаИзмененаВручную = Истина;
	КонецЦикла;
	
	оДок.Согласован = Истина;
	оДок.Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
	
	оДок.Записать(РежимЗаписиДокумента.Запись);
	оДок.Записать(РежимЗаписиДокумента.Проведение);
КонецФункции

&НаСервере
Функция Получить_УстановкаЦенНоменклатуры(дата)
	результ = неопределено;
	Запрос = Новый Запрос;
	маркер = "|Материалы цена|";//+дата;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УстановкаЦенНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	               |ГДЕ
	               |	УстановкаЦенНоменклатуры.Комментарий ПОДОБНО &Маркер
	               |	И НЕ УстановкаЦенНоменклатуры.ПометкаУдаления
	               |	И УстановкаЦенНоменклатуры.Дата >= &ДатаН
	               |	И УстановкаЦенНоменклатуры.Дата <= &ДатаК";
	
	Запрос.УстановитьПараметр("маркер","%"+маркер+"%");
	Запрос.УстановитьПараметр("ДатаН",НачалоДня(дата));
	Запрос.УстановитьПараметр("ДатаК",КонецДня(дата));
	рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		результ = рез.Ссылка;
	Иначе
		док = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		док.Дата = НачалоДня(дата);
		док.Комментарий = маркер;
		док.Записать(РежимЗаписиДокумента.Запись);
		результ = док.Ссылка;
	КонецЕсли;
	Возврат результ;
КонецФункции
